Revit 2027 API
ViewSchedule.Definition Property
 The primary ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleDefinition Definition { get; }
Public ReadOnly Property Definition As ScheduleDefinition
	Get
public:
property ScheduleDefinition^ Definition {
	ScheduleDefinition^ get ();
}
member Definition : ScheduleDefinition with get
Property Value
ScheduleDefinition
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace